{
  "street-address": "5659 Boulder Canyon Dr Castro Valley, CA 94552",
  "city": "Castro Valley",
  "state": "CA",
  "postal-code": 94552,
  "price": "$1,670,000",
  "type": "Single Family Home",
  "room-count": 4,
  "bath-count": "3 1/2",
  "sqft": "3,236",
  "lot-sqft": "22,011 ",
  "year-built": 1996,
  "description": "\nIf perfection can be personified, it has been in this stunning home. No detail was left untouched: from the exquisitely renovated chef’s kitchen to the large, luxurious master suite to the extraordinary outdoor living spaces, this home invokes elegance, grace and serenity, and the lifestyle people seek in the Five Canyons area.<br><br>\n\n \nThe first level’s high-ceilinged entry and gorgeous living room with white oak plank flooring set the stage for the elegant rooms that flow from it, including a remodeled eat-in kitchen with amazing quartz countertops, a six-burner Viking stove, double KitchenAid Convection oven, KitchenAid fridge and dishwasher, gorgeous stainless steel apron front sink and large pantry, open to the family room. Right beyond the kitchen you will find a stately dining room with glass door leading to the lush yard.  Also on the main floor is the beautifully remodeled powder room and large lower-level laundry room with access to the yard and finally the three-car garage with lots of storage and a workbench. <br><br>\n\n \nDirectly outside, from the kitchen the magnificently landscaped backyard beckons, offering sitting areas and the shade of a 100-year-old oak and the perfect pergola for the ideal dining experience equipped with a built in, gas-plumbed barbeque with a burner and counter space. This park like setting is over half an acre and offers complete privacy.  The beautiful front and backyard have feature spotlights which shine upon the redwoods, pine trees, native oak trees, maple trees, madrones, dogwoods and ornamental plum trees all equipped with complete automatic sprinkler system and commercial grade drainage throughout the property.  Low voltage, LED lights automatically accommodate the evenings and turn off in the morning.  There is also electricity throughout the grounds and six hose bibs throughout the backyard.  A beautifully light filled water feature creates the perfect area for all those who seek relaxation.<br><br>\n\n \nBack inside, an elegant, curved staircase leads to the upper level, which features a sitting area, office, magnificent master suite, three additional bedrooms, two full baths, and the loft area to complete the second floor. This home is destined to charm and delight.<br><br>\n\n \nOne of the finest features of the upstairs is the master bedroom replete with tall ceilings, a glorious view of the backyard and an opulent brand new bathroom.  The stunning avant-garde design perfectly embraces the new bathtub, gorgeous beautifully tiled shower with multiple showerheads, two vanities and a private W.C. as well as access to a very large walk-in closet.<br><br>\n\n \nThree additional bedrooms, and two of them have access to attached full bathrooms, complete the upstairs.  One of the bedrooms has a walk in closet and plantation shutters.  The entire story exhibits brand new lush carpeting.<br><br>\n\n \nThis home defines elegance as an exceptional home nestled on more than half an acre in the prestigious Five Canyons area.  The 5 Canyons community is sought after for is many offerings, some of the favorite highlights are a family friendly community pool, the perfect club house for events and gatherings, RV parking, and for and extra fun and exercise, 5 Canyons has tennis courts, basketball courts and hiking trails. The 5 Canyons Community is ideally located all within close proximity to both Castro Valley and San Ramon.  The area boasts a wide range of amenities and attractions, including Lake Chabot Regional Park, the Castro Valley farmer’s markets, and a variety of restaurants, all within commuting distance of San Francisco, the East Bay and the South Bay.<br>",
  "photo": "images/avatar.png"
}
